src/Catalogs/КонфигурацииКлиентов/КонфигурацииКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонфигурацииКлиентов</name>
  <owners>Catalog.Клиенты</owners>
  <attributes>
    <name>ВидКонфигурации</name>
    <type>
      <types>EnumRef.ВидыКонфигурацийКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТиповаяКонфигурация</name>
    <type>
      <types>CatalogRef.ТиповыеПродукты1С</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Изменения</name>
    <attributes>
      <name>ОписаниеИзменения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ВидыКонфигурацийКлиентов/ВидыКонфигурацийКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКонфигурацийКлиентов</name>
  <enumValues>
    <name>Типовая</name>
  </enumValues>
  <enumValues>
    <name>Нетиповая</name>
  </enumValues>
  <enumValues>
    <name>ТиповаяИзмененная</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/КонфигурацииКлиентов/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ВидКонфигурацииПриИзменении(Элемент)
	УправлениеДоступностью();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеДоступностью();
КонецПроцедуры

Процедура УправлениеДоступностью()
	
	Если Объект.ВидКонфигурации = ПредопределенноеЗначение("Перечисление.ВидыКонфигурацийКлиентов.Типовая")
		ИЛИ Объект.ВидКонфигурации = ПредопределенноеЗначение("Перечисление.ВидыКонфигурацийКлиентов.ТиповаяИзмененная") Тогда
		ДоступностьТиповойКонфигурации = Истина;
	Иначе
		ДоступностьТиповойКонфигурации = Ложь;
	КонецЕсли;
	Элементы.ТиповаяКонфигурация.Доступность = ДоступностьТиповойКонфигурации;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.ВидКонфигурации = ПредопределенноеЗначение("Перечисление.ВидыКонфигурацийКлиентов.Типовая") и НЕ ЗначениеЗаполнено(Объект.ТиповаяКонфигурация) тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите типовую конфигурацию!",,"ТиповаяКонфигурация","ТиповаяКонфигурация",Отказ);
	КонецЕсли;
КонецПроцедуры
